# 开发人:胡雪晴
# 开发时间: 2022/9/16 10:22
'''
不可变序列,没有增删改操作:元组 字符串 整型 浮点型
可变序列可以进行增删改操作,且对象地址不发生改变:列表 字典 集合
有序序列:列表 元组
无序序列:字典 集合
元组支持索引和切片
'''
#创建
t0=('123','sbd',90)#()
t2='434','fd',4#()可以省略
t3=(123,)#单元素元组需要加上逗号
t4=123,
t1=tuple(('df','的',3.3))#tuple()
print(t0,t1,t2,t3,t4,type(t2),type(t3),type(t4))
t5=()#空元组
t6=tuple()#空元组
print(t6,t5)

'''
元组中存储的是对象的引用
如果元组中的对象本身是不可变对象,则不能在引用其他对象
如果元组中的对象是可变对象,则可变对象的引用不允许改变,但是数据可以改变
'''
t=(10,[20,30],40)
print(t,type(t),id(t))
print(t[0],type(t[0]),id(t[0]))
print(t[1],type(t[1]),id(t[1]))
print(t[2],type(t[2]),id(t[2]))
#t[1]=100报错,元组不可修改
t[1].append(50)
t[1][0]=55
print(t[1],type(t[1]),id(t[1]))
print(t,type(t),id(t))

#获取元组的方式
#索引t[]
#遍历for-in
for i in t:
    print(i)